Revit 2026 API
ParameterFilterUtilities Class
 Contains static utility functions for enumerating the categories and parameters that are available for use by ParameterFilterElement objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterFilterUtilities
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class ParameterFilterUtilities
Public NotInheritable Class ParameterFilterUtilities
public ref class ParameterFilterUtilities abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ParameterFilterUtilities = class end
The ParameterFilterUtilities type exposes the following members.
Methods
Name | Description
GetAllFilterableCategories |  Returns the set of categories that may be used in a ParameterFilterElement.
GetFilterableParametersInCommon
GetInapplicableParameters
IsParameterApplicable |  Used to determine whether the element supports the given parameter.
RemoveUnfilterableCategories
Top
See Also
Reference
Autodesk.Revit.DB Namespace